Right-click on the router
Click Start
Click Console
Press Enter and wait for the prompt to appear:

R1#

If the prompt reads "R1>", you are in User EXEC Mode. Enter "enable" at the prompt to enter Priviledged EXEC Mode:
Enter the following commands to reset the device. At the "[confirm]" prompts, press [ENTER]:

R1#write erase
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
R1#
*Mar  1 00:13:00.067: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
R1#reload
Proceed with reload? [confirm]

R1#configure terminal ! Enter Global Configuration Mode
R1(config)#interface FastEthernet 0/0 ! Enter Interface Configuration Mode
R1(config-if)#ip address 192.168.1.10 255.255.255.0 ! Set the IP address of the router
R1(config-if)#no shutdown ! Bring up the interface
R1(config-if)#exit ! Exit Interface Configuration Mode
R1(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.100 ! Configure the default gateway
R1(config)# end ! Exit Global Configuration Mode
R1#
*Mar  1 00:13:00.067: %SYS-5-CONFIG_I: Configured from memory by console

Ping the routerâ€™s default gateway:
Copy
R1# ping 192.168.1.100

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.100, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 32/36/40 ms
R1#

R1#write memory ! Save the new configuration to flash memory
Building configuration...
[OK]
R1#

Now look at the new and current configuration of the router
R1#show running-config
Building configuration...

Current configuration :
...
end

#R1

Compare to the startup configuration settings in the NVRAM:
#R1show startup-config
Using 1985 out of 155640 bytes
...
end

R1#

Now copy the current settings to the NVRAM. At the "Destination filename" prompt, press [ENTER] or input "startup-config":
R1#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
R1#